class User < ApplicationRecord
  # Include default devise modules. Others available are:
  # :confirmable, :lockable, :timeoutable, :trackable and :omniauthable
  devise :database_authenticatable, :registerable,
         :recoverable, :rememberable, :validatable

  # enum for gender_id
    enum gender_id: {
      '男性':1,
      '女性':2
    }

    enum year_of_birth_id: {
      '1950', '1951', '1952', '1953', '1954', '1955', '1956', '1957', '1958', '1959',
      '1960', '1961', '1962', '1963', '1964', '1965', '1966', '1967', '1968', '1969',
      '1970', '1971', '1972', '1973', '1974', '1975', '1976', '1977', '1978', '1979',
      '1980', '1981', '1982', '1983', '1984', '1985', '1986', '1987', '1988', '1989',
      '1990', '1991', '1992', '1993', '1994', '1995', '1996', '1997', '1998', '1999',
      '2000', '2001', '2002', '2003', '2004', '2005', '2006', '2007', '2008', '2009',
      '2010', '2011', '2012', '2013', '2014', '2015', '2016', '2017', '2018', '2019'
    }

    enum address_id: {
      '北海道':1,  '青森県':2,  '岩手県':3,  '宮城県':4,    '秋田県':5,  '山形県':6,    '福島県':7,  '茨城県':8,  '栃木県':9,  '群馬県':10,
      '埼玉県':11, '千葉県':12, '東京都':13, '神奈川県':14, '新潟県':15, '富山県':16,   '石川県':17, '福井県':18, '山梨県':19, '長野県':20,
      '岐阜県':21, '静岡県':22, '愛知県':23, '三重県':24,   '滋賀県':25, '京都府':26,   '大阪府':27, '兵庫県':28, '奈良県':29, '和歌山県':30,
      '鳥取県':31, '島根県':32, '岡山県':33, '広島県':34,   '山口県':35, '徳島県':36,   '香川県':37, '愛媛県':38, '高知県':39, '福岡県':40,
      '佐賀県':41, '長崎県':42, '熊本県':43, '大分県':44,   '宮崎県':45, '鹿児島県':46, '沖縄県':47
    }

end
